{
  "_name_or_path": "Xenova/quickdraw-mobilevit-small",
  "architectures": [
    "MobileViTForImageClassification"
  ],
  "aspp_dropout_prob": 0.1,
  "aspp_out_channels": 256,
  "atrous_rates": [
    6,
    12,
    18
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout_prob": 0.1,
  "conv_kernel_size": 3,
  "expand_ratio": 4.0,
  "hidden_act": "silu",
  "hidden_dropout_prob": 0.1,
  "hidden_sizes": [
    144,
    192,
    240
  ],
  "id2label": {
    "0": "航空母艦",
    "1": "飛行機",
    "2": "目覚まし時計",
    "3": "救急車",
    "4": "天使",
    "5": "動物の移動",
    "6": "アリ",
    "7": "金床",
    "8": "リンゴ",
    "9": "腕",
    "10": "アスパラガス",
    "11": "斧",
    "12": "バックパック",
    "13": "バナナ",
    "14": "包帯",
    "15": "納屋",
    "16": "野球のバット",
    "17": "野球",
    "18": "バスケット",
    "19": "バスケットボール",
    "20": "コウモリ",
    "21": "浴槽",
    "22": "ビーチ",
    "23": "熊",
    "24": "ひげ",
    "25": "ベッド",
    "26": "ミツバチ",
    "27": "ベルト",
    "28": "ベンチ",
    "29": "自転車",
    "30": "双眼鏡",
    "31": "鳥",
    "32": "誕生日のケーキ",
    "33": "ブラックベリー",
    "34": "ブルーベリー",
    "35": "本",
    "36": "ブーメラン",
    "37": "ボトルキャップ",
    "38": "蝶ネクタイ",
    "39": "ブレスレット",
    "40": "脳",
    "41": "パン",
    "42": "橋",
    "43": "ブロッコリー",
    "44": "ほうき",
    "45": "バケツ",
    "46": "ブルドーザー",
    "47": "バス",
    "48": "低木",
    "49": "蝶",
    "50": "サボテン",
    "51": "ケーキ",
    "52": "電卓",
    "53": "カレンダー",
    "54": "ラクダ",
    "55": "カメラ",
    "56": "迷彩",
    "57": "キャンプファイヤー",
    "58": "ろうそく",
    "59": "大砲",
    "60": "カヌー",
    "61": "自動車",
    "62": "ニンジン",
    "63": "城",
    "64": "猫",
    "65": "天井ファン",
    "66": "携帯電話",
    "67": "チェロ",
    "68": "椅子",
    "69": "シャンデリア",
    "70": "教会",
    "71": "円",
    "72": "クラリネット",
    "73": "時計",
    "74": "雲",
    "75": "コーヒーカップ",
    "76": "コンパス",
    "77": "コンピューター",
    "78": "クッキー",
    "79": "クーラー",
    "80": "ソファ",
    "81": "牛",
    "82": "カニ",
    "83": "クレヨン",
    "84": "ワニ",
    "85": "王冠",
    "86": "クルーズ船",
    "87": "カップ",
    "88": "ダイヤモンド",
    "89": "食器洗い機",
    "90": "飛び込み板",
    "91": "犬",
    "92": "イルカ",
    "93": "ドーナツ",
    "94": "ドア",
    "95": "ドラゴン",
    "96": "ドレッサー",
    "97": "ドリル",
    "98": "ドラム",
    "99": "アヒル",
    "100": "ダンベル",
    "101": "耳",
    "102": "肘",
    "103": "象",
    "104": "封筒",
    "105": "消しゴム",
    "106": "目",
    "107": "眼鏡",
    "108": "顔",
    "109": "扇風機",
    "110": "羽",
    "111": "フェンス",
    "112": "指",
    "113": "消火栓",
    "114": "暖炉",
    "115": "消防車",
    "116": "魚",
    "117": "フラミンゴ",
    "118": "懐中電灯",
    "119": "ビーチサンダル",
    "120": "フロアランプ",
    "121": "花",
    "122": "空飛ぶ円盤",
    "123": "足",
    "124": "フォーク",
    "125": "カエル",
    "126": "フライパン",
    "127": "ガーデンホース",
    "128": "庭",
    "129": "キリン",
    "130": "ゴーティー",
    "131": "ゴルフクラブ",
    "132": "ブドウ",
    "133": "草",
    "134": "ギター",
    "135": "ハンバーガー",
    "136": "ハンマー",
    "137": "手",
    "138": "ハープ",
    "139": "帽子",
    "140": "ヘッドホン",
    "141": "ハリネズミ",
    "142": "ヘリコプター",
    "143": "ヘルメット",
    "144": "六角形",
    "145": "ホッケーパック",
    "146": "ホッケースティック",
    "147": "馬",
    "148": "病院",
    "149": "熱気球",
    "150": "ホットドッグ",
    "151": "ホットタブ",
    "152": "砂時計",
    "153": "観葉植物",
    "154": "家",
    "155": "ハリケーン",
    "156": "アイスクリーム",
    "157": "ジャケット",
    "158": "刑務所",
    "159": "カンガルー",
    "160": "鍵",
    "161": "キーボード",
    "162": "膝",
    "163": "ナイフ",
    "164": "はしご",
    "165": "ランタン",
    "166": "ラップトップ",
    "167": "葉",
    "168": "脚",
    "169": "電球",
    "170": "ライター",
    "171": "灯台",
    "172": "雷",
    "173": "線",
    "174": "ライオン",
    "175": "口紅",
    "176": "ロブスター",
    "177": "ロリポップ",
    "178": "郵便受け",
    "179": "地図",
    "180": "マーカー",
    "181": "マッチ",
    "182": "メガホン",
    "183": "人魚",
    "184": "マイクロフォン",
    "185": "電子レンジ",
    "186": "猿",
    "187": "月",
    "188": "蚊",
    "189": "オートバイ",
    "190": "山",
    "191": "マウス",
    "192": "口髭",
    "193": "口",
    "194": "マグカップ",
    "195": "キノコ",
    "196": "釘",
    "197": "ネックレス",
    "198": "鼻",
    "199": "海",
    "200": "八角形",
    "201": "タコ",
    "202": "玉ねぎ",
    "203": "オーブン",
    "204": "フクロウ",
    "205": "塗料缶",
    "206": "絵筆",
    "207": "ヤシの木",
    "208": "パンダ",
    "209": "ズボン",
    "210": "ペーパークリップ",
    "211": "パラシュート",
    "212": "オウム",
    "213": "パスポート",
    "214": "ピーナッツ",
    "215": "ナシ",
    "216": "エンドウ",
    "217": "鉛筆",
    "218": "ペンギン",
    "219": "ピアノ",
    "220": "ピックアップトラック",
    "221": "写真立て",
    "222": "豚",
    "223": "枕",
    "224": "パイナップル",
    "225": "ピザ",
    "226": "ペンチ",
    "227": "パトカー",
    "228": "池",
    "229": "プール",
    "230": "アイスキャンディー",
    "231": "ポストカード",
    "232": "ジャガイモ",
    "233": "電源コンセント",
    "234": "財布",
    "235": "ウサギ",
    "236": "アライグマ",
    "237": "ラジオ",
    "238": "雨",
    "239": "虹",
    "240": "レーキ（熊手）",
    "241": "リモコン",
    "242": "サイ",
    "243": "ライフル",
    "244": "川",
    "245": "ジェットコースター",
    "246": "ローラースケート",
    "247": "帆船",
    "248": "サンドイッチ",
    "249": "のこぎり",
    "250": "サックス",
    "251": "スクールバス",
    "252": "はさみ",
    "253": "サソリ",
    "254": "ドライバー",
    "255": "ウミガメ",
    "256": "シーソー",
    "257": "サメ",
    "258": "羊",
    "259": "靴",
    "260": "ショートパンツ",
    "261": "シャベル",
    "262": "シンク",
    "263": "スケートボード",
    "264": "頭蓋骨",
    "265": "摩天楼",
    "266": "寝袋",
    "267": "スマイリーフェイス",
    "268": "カタツムリ",
    "269": "ヘビ",
    "270": "シュノーケル",
    "271": "雪の結晶",
    "272": "雪だるま",
    "273": "サッカーボール",
    "274": "靴下",
    "275": "スピードボート",
    "276": "クモ",
    "277": "スプーン",
    "278": "スプレッドシート",
    "279": "正方形",
    "280": "スクイグル",
    "281": "リス",
    "282": "階段",
    "283": "星",
    "284": "ステーキ",
    "285": "ステレオ",
    "286": "聴診器",
    "287": "縫い目",
    "288": "一時停止標識",
    "289": "ストーブ",
    "290": "イチゴ",
    "291": "街灯",
    "292": "インゲン",
    "293": "潜水艦",
    "294": "スーツケース",
    "295": "太陽",
    "296": "白鳥",
    "297": "セーター",
    "298": "ブランコ",
    "299": "剣",
    "300": "注射器",
    "301": "Tシャツ",
    "302": "テーブル",
    "303": "ティーポット",
    "304": "テディベア",
    "305": "電話",
    "306": "テレビ",
    "307": "テニスラケット",
    "308": "テント",
    "309": "エッフェル塔",
    "310": "万里の長城",
    "311": "モナリザ",
    "312": "虎",
    "313": "トースター",
    "314": "つま先",
    "315": "トイレ",
    "316": "歯",
    "317": "歯ブラシ",
    "318": "歯磨き粉",
    "319": "竜巻",
    "320": "トラクター",
    "321": "信号機",
    "322": "列車",
    "323": "木",
    "324": "三角形",
    "325": "トロンボーン",
    "326": "トラック",
    "327": "トランペット",
    "328": "傘",
    "329": "下着",
    "330": "バン",
    "331": "花瓶",
    "332": "バイオリン",
    "333": "洗濯機",
    "334": "スイカ",
    "335": "ウォータースライド",
    "336": "鯨",
    "337": "車輪",
    "338": "風車",
    "339": "ワインボトル",
    "340": "ワイングラス",
    "341": "腕時計",
    "342": "ヨガ",
    "343": "シマウマ",
    "344": "ジグザグ"
  },
  "ignore_mismatched_sizes": true,
  "image_size": 28,
  "initializer_range": 0.02,
  "label2id": {
    "航空母艦": "0",
    "飛行機": "1",
    "目覚まし時計": "2",
    "救急車": "3",
    "天使": "4",
    "動物の移動": "5",
    "アリ": "6",
    "金床": "7",
    "リンゴ": "8",
    "腕": "9",
    "アスパラガス": "10",
    "斧": "11",
    "バックパック": "12",
    "バナナ": "13",
    "包帯": "14",
    "納屋": "15",
    "野球のバット": "16",
    "野球": "17",
    "バスケット": "18",
    "バスケットボール": "19",
    "コウモリ": "20",
    "浴槽": "21",
    "ビーチ": "22",
    "熊": "23",
    "ひげ": "24",
    "ベッド": "25",
    "ミツバチ": "26",
    "ベルト": "27",
    "ベンチ": "28",
    "自転車": "29",
    "双眼鏡": "30",
    "鳥": "31",
    "誕生日のケーキ": "32",
    "ブラックベリー": "33",
    "ブルーベリー": "34",
    "本": "35",
    "ブーメラン": "36",
    "ボトルキャップ": "37",
    "蝶ネクタイ": "38",
    "ブレスレット": "39",
    "脳": "40",
    "パン": "41",
    "橋": "42",
    "ブロッコリー": "43",
    "ほうき": "44",
    "バケツ": "45",
    "ブルドーザー": "46",
    "バス": "47",
    "低木": "48",
    "蝶": "49",
    "サボテン": "50",
    "ケーキ": "51",
    "電卓": "52",
    "カレンダー": "53",
    "ラクダ": "54",
    "カメラ": "55",
    "迷彩": "56",
    "キャンプファイヤー": "57",
    "ろうそく": "58",
    "大砲": "59",
    "カヌー": "60",
    "自動車": "61",
    "ニンジン": "62",
    "城": "63",
    "猫": "64",
    "天井ファン": "65",
    "携帯電話": "66",
    "チェロ": "67",
    "椅子": "68",
    "シャンデリア": "69",
    "教会": "70",
    "円": "71",
    "クラリネット": "72",
    "時計": "73",
    "雲": "74",
    "コーヒーカップ": "75",
    "コンパス": "76",
    "コンピューター": "77",
    "クッキー": "78",
    "クーラー": "79",
    "ソファ": "80",
    "牛": "81",
    "カニ": "82",
    "クレヨン": "83",
    "ワニ": "84",
    "王冠": "85",
    "クルーズ船": "86",
    "カップ": "87",
    "ダイヤモンド": "88",
    "食器洗い機": "89",
    "飛び込み板": "90",
    "犬": "91",
    "イルカ": "92",
    "ドーナツ": "93",
    "ドア": "94",
    "ドラゴン": "95",
    "ドレッサー": "96",
    "ドリル": "97",
    "ドラム": "98",
    "アヒル": "99",
    "ダンベル": "100",
    "耳": "101",
    "肘": "102",
    "象": "103",
    "封筒": "104",
    "消しゴム": "105",
    "目": "106",
    "眼鏡": "107",
    "顔": "108",
    "扇風機": "109",
    "羽": "110",
    "フェンス": "111",
    "指": "112",
    "消火栓": "113",
    "暖炉": "114",
    "消防車": "115",
    "魚": "116",
    "フラミンゴ": "117",
    "懐中電灯": "118",
    "ビーチサンダル": "119",
    "フロアランプ": "120",
    "花": "121",
    "空飛ぶ円盤": "122",
    "足": "123",
    "フォーク": "124",
    "カエル": "125",
    "フライパン": "126",
    "ガーデンホース": "127",
    "庭": "128",
    "キリン": "129",
    "ゴーティー": "130",
    "ゴルフクラブ": "131",
    "ブドウ": "132",
    "草": "133",
    "ギター": "134",
    "ハンバーガー": "135",
    "ハンマー": "136",
    "手": "137",
    "ハープ": "138",
    "帽子": "139",
    "ヘッドホン": "140",
    "ハリネズミ": "141",
    "ヘリコプター": "142",
    "ヘルメット": "143",
    "六角形": "144",
    "ホッケーパック": "145",
    "ホッケースティック": "146",
    "馬": "147",
    "病院": "148",
    "熱気球": "149",
    "ホットドッグ": "150",
    "ホットタブ": "151",
    "砂時計": "152",
    "観葉植物": "153",
    "家": "154",
    "ハリケーン": "155",
    "アイスクリーム": "156",
    "ジャケット": "157",
    "刑務所": "158",
    "カンガルー": "159",
    "鍵": "160",
    "キーボード": "161",
    "膝": "162",
    "ナイフ": "163",
    "はしご": "164",
    "ランタン": "165",
    "ラップトップ": "166",
    "葉": "167",
    "脚": "168",
    "電球": "169",
    "ライター": "170",
    "灯台": "171",
    "雷": "172",
    "線": "173",
    "ライオン": "174",
    "口紅": "175",
    "ロブスター": "176",
    "ロリポップ": "177",
    "郵便受け": "178",
    "地図": "179",
    "マーカー": "180",
    "マッチ": "181",
    "メガホン": "182",
    "人魚": "183",
    "マイクロフォン": "184",
    "電子レンジ": "185",
    "猿": "186",
    "月": "187",
    "蚊": "188",
    "オートバイ": "189",
    "山": "190",
    "マウス": "191",
    "口髭": "192",
    "口": "193",
    "マグカップ": "194",
    "キノコ": "195",
    "釘": "196",
    "ネックレス": "197",
    "鼻": "198",
    "海": "199",
    "八角形": "200",
    "タコ": "201",
    "玉ねぎ": "202",
    "オーブン": "203",
    "フクロウ": "204",
    "塗料缶": "205",
    "絵筆": "206",
    "ヤシの木": "207",
    "パンダ": "208",
    "ズボン": "209",
    "ペーパークリップ": "210",
    "パラシュート": "211",
    "オウム": "212",
    "パスポート": "213",
    "ピーナッツ": "214",
    "ナシ": "215",
    "エンドウ": "216",
    "鉛筆": "217",
    "ペンギン": "218",
    "ピアノ": "219",
    "ピックアップトラック": "220",
    "写真立て": "221",
    "豚": "222",
    "枕": "223",
    "パイナップル": "224",
    "ピザ": "225",
    "ペンチ": "226",
    "パトカー": "227",
    "池": "228",
    "プール": "229",
    "アイスキャンディー": "230",
    "ポストカード": "231",
    "ジャガイモ": "232",
    "電源コンセント": "233",
    "財布": "234",
    "ウサギ": "235",
    "アライグマ": "236",
    "ラジオ": "237",
    "雨": "238",
    "虹": "239",
    "レーキ（熊手）": "240",
    "リモコン": "241",
    "サイ": "242",
    "ライフル": "243",
    "川": "244",
    "ジェットコースター": "245",
    "ローラースケート": "246",
    "帆船": "247",
    "サンドイッチ": "248",
    "のこぎり": "249",
    "サックス": "250",
    "スクールバス": "251",
    "はさみ": "252",
    "サソリ": "253",
    "ドライバー": "254",
    "ウミガメ": "255",
    "シーソー": "256",
    "サメ": "257",
    "羊": "258",
    "靴": "259",
    "ショートパンツ": "260",
    "シャベル": "261",
    "シンク": "262",
    "スケートボード": "263",
    "頭蓋骨": "264",
    "摩天楼": "265",
    "寝袋": "266",
    "スマイリーフェイス": "267",
    "カタツムリ": "268",
    "ヘビ": "269",
    "シュノーケル": "270",
    "雪の結晶": "271",
    "雪だるま": "272",
    "サッカーボール": "273",
    "靴下": "274",
    "スピードボート": "275",
    "クモ": "276",
    "スプーン": "277",
    "スプレッドシート": "278",
    "正方形": "279",
    "スクイグル": "280",
    "リス": "281",
    "階段": "282",
    "星": "283",
    "ステーキ": "284",
    "ステレオ": "285",
    "聴診器": "286",
    "縫い目": "287",
    "一時停止標識": "288",
    "ストーブ": "289",
    "イチゴ": "290",
    "街灯": "291",
    "インゲン": "292",
    "潜水艦": "293",
    "スーツケース": "294",
    "太陽": "295",
    "白鳥": "296",
    "セーター": "297",
    "ブランコ": "298",
    "剣": "299",
    "注射器": "300",
    "Tシャツ": "301",
    "テーブル": "302",
    "ティーポット": "303",
    "テディベア": "304",
    "電話": "305",
    "テレビ": "306",
    "テニスラケット": "307",
    "テント": "308",
    "エッフェル塔": "309",
    "万里の長城": "310",
    "モナリザ": "311",
    "虎": "312",
    "トースター": "313",
    "つま先": "314",
    "トイレ": "315",
    "歯": "316",
    "歯ブラシ": "317",
    "歯磨き粉": "318",
    "竜巻": "319",
    "トラクター": "320",
    "信号機": "321",
    "列車": "322",
    "木": "323",
    "三角形": "324",
    "トロンボーン": "325",
    "トラック": "326",
    "トランペット": "327",
    "傘": "328",
    "下着": "329",
    "バン": "330",
    "花瓶": "331",
    "バイオリン": "332",
    "洗濯機": "333",
    "スイカ": "334",
    "ウォータースライド": "335",
    "鯨": "336",
    "車輪": "337",
    "風車": "338",
    "ワインボトル": "339",
    "ワイングラス": "340",
    "腕時計": "341",
    "ヨガ": "342",
    "シマウマ": "343",
    "ジグザグ": "344"
  },
  "layer_norm_eps": 1e-05,
  "mlp_ratio": 2.0,
  "model_type": "mobilevit",
  "neck_hidden_sizes": [
    16,
    32,
    64,
    96,
    128,
    160,
    640
  ],
  "num_attention_heads": 4,
  "num_channels": 1,
  "output_stride": 32,
  "patch_size": 2,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "semantic_loss_ignore_index": 255,
  "transformers_version": "4.31.0.dev0"
}
